PC Client/Documents/БольничныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>БольничныйЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
				<xr:Item>AccumulationRegister.УчётЗатрат</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчётный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

PC Client/CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПредприятия</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПредприятия.Resource.КоличествоЧасов</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПредприятия.Dimension.День</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоказательРасчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

PC Client/AccumulationRegisters/УчётЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>УчётЗатрат</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

PC Client/AccountingRegisters/Хозрасчётный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчётный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчётный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

PC Client/Documents/БольничныйЛист/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Начисления.Записывать = Истина;
    Движения.УчётЗатрат.Записывать = Истина;
	Движения.Хозрасчётный.Записывать = Истина;
    
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |    КадроваяИсторияСотрудниковСрезПоследних.Оклад КАК Оклад
    |ИЗ
    |    РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(&Период, ) КАК КадроваяИсторияСотрудниковСрезПоследних
    |ГДЕ
    |    КадроваяИсторияСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
    Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаОкончания);
    Запрос.УстановитьПараметр("Сотрудник", ЭтотОбъект.Сотрудник);
    
    Результат = Запрос.Выполнить();
    
    Если Результат.Пустой() Тогда
        ПараметрРасчета = 0;
    Иначе
        ПараметрРасчета = Запрос.Выполнить().Выгрузить()[0].Оклад;
    КонецЕсли;
    
    МесяцНачаисления = НачалоМесяца(ЭтотОбъект.ДатаНачала);
    МесяцОкончания = НачалоМесяца(ЭтотОбъект.ДатаОкончания);
    //РегистрНачисления
    Пока МесяцНачаисления <= МесяцОкончания Цикл
        Движение = Движения.Начисления.Добавить();
        Движение.Сторно = Ложь;
        Движение.ВидРасчета = ПланыВидовРасчета.Начисления.Больничный;
        Движение.ПериодДействияНачало = Макс(ЭтотОбъект.ДатаНачала, МесяцНачаисления);
        Движение.ПериодДействияКонец = Мин(ЭтотОбъект.ДатаОкончания, КонецМесяца(МесяцНачаисления));
        Движение.ПериодРегистрации = ЭтотОбъект.ПериодНачисления;
        Движение.БазовыйПериодНачало = Макс(ЭтотОбъект.ДатаНачала, МесяцНачаисления);
        Движение.БазовыйПериодКонец = Мин(ЭтотОбъект.ДатаОкончания, КонецМесяца(МесяцНачаисления));
        Движение.Сотрудник = Сотрудник;
        Движение.ПоказательРасчета = ПараметрРасчета;
        
        МесяцНачаисления = ДобавитьМесяц(МесяцНачаисления, 1);    
    КонецЦикла;
    
    Движения.Начисления.Записать();
    Движения.Начисления.РассчитатьСуммуНачисления();
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Начисления.Сотрудник КАК Сотрудник,
    |    СУММА(Начисления.Сумма) КАК Сумма,
    |    Начисления.ВидРасчета.СтатьяЗатрат КАК СтатьяЗатрат
    |ИЗ
    |    РегистрРасчета.Начисления КАК Начисления
    |ГДЕ
    |    Начисления.Регистратор = &Регистратор
    |
    |СГРУППИРОВАТЬ ПО
    |    Начисления.Сотрудник,
    |    Начисления.ВидРасчета.СтатьяЗатрат";
    
    Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий();
    
    //РегистрУчётЗатрат    
    ДвижениеЗатрат = Движения.УчётЗатрат.Добавить();
    ДвижениеЗатрат.Период = Дата;
    ДвижениеЗатрат.Сумма = Выборка.Сумма;
    ДвижениеЗатрат.СтатьяЗатрат = Выборка.СтатьяЗатрат;
	// РегистрХозрасчётный     
    ДвижениеХозрасчётный = Движения.Хозрасчётный.Добавить();
    ДвижениеХозрасчётный.СчетДт = ПланыСчетов.Хозрасчётный.РасходыНаПродажу;     
    ДвижениеХозрасчётный.СчетКт = ПланыСчетов.Хозрасчётный.РасчетыСПерсоналомПоОплатеТруда;
    ДвижениеХозрасчётный.Период = Дата;        
    ДвижениеХозрасчётный.Сумма = Выборка.Сумма;        
    ДвижениеХозрасчётный.Содержание = "Отражено начисление по больничному листу";
    БухгалтерскийУчёт.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчётный.СчетДт, 
                    ДвижениеХозрасчётный.СубконтоДт, Выборка.СтатьяЗатрат);
    БухгалтерскийУчёт.ЗаполнитьСубконтоПоСчету(ДвижениеХозрасчётный.СчетКт, 
                        ДвижениеХозрасчётный.СубконтоКт, Выборка.Сотрудник);
КонецПроцедуры
